#+title: Lesson 00 — The Bloch Equations
#+subtitle: Spin Dynamics as Pure Functions
#+author: MāyāPramāṇa
#+date: February 2026
#+LOOM: lesson
#+DEFINES: BlochState BlochParams bloch_derivative rk4_step simulate rb87Params
#+DEPENDS: (none)
#+EXPORTS: bloch_precession.png
#+CADENZAS: spin-half-qm bloch-sphere-geometry numerical-ode-methods atomic-magnetometry
#+property: header-args :mkdirp yes
#+property: header-args:python :session bloch :results output
#+property: header-args:haskell :tangle ../../haskell/src/Physics/Bloch.hs
#+property: header-args:cpp :tangle ../../cpp/src/core/bloch.hpp

#+begin_quote
I think I can safely say that nobody understands quantum mechanics.
--- Richard Feynman, /The Character of Physical Law/, 1964
#+end_quote

And yet we can write down the equations that describe it, simulate
them on a computer, and build instruments that exploit them to measure
magnetic fields with extraordinary precision. Understanding may be
elusive, but the mathematics is not.

This lesson develops the Bloch equations — the dynamical equations for
a spin-½ system in an external magnetic field — from first principles.
We implement them in three languages: Python (for interactive
exploration), Haskell (as executable specification), and C++ (for
deployment). The physics is identical in all three. The expressions
differ; the content does not.

** Constants and Types

#+begin_src python
import numpy as np
from dataclasses import dataclass


@dataclass
class BlochState:
    """The Bloch vector M = (Mx, My, Mz)."""
    mx: float
    my: float
    mz: float

    def as_array(self) -> np.ndarray:
        return np.array([self.mx, self.my, self.mz])

    @staticmethod
    def from_array(a: np.ndarray) -> 'BlochState':
        return BlochState(mx=a[0], my=a[1], mz=a[2])

    @property
    def norm(self) -> float:
        return np.sqrt(self.mx**2 + self.my**2 + self.mz**2)


@dataclass
class BlochParams:
    """Physical parameters for the Bloch equations."""
    gamma: float    # gyromagnetic ratio [rad/s/T]
    t1: float       # longitudinal relaxation time [s]
    t2: float       # transverse relaxation time [s]
    m0: float       # equilibrium magnetisation (dimensionless)


# Rb-87 ground state F=2
RB87_PARAMS = BlochParams(
    gamma=2 * np.pi * 7e9 * 0.5,  # g_F * mu_B / hbar
    t1=0.1,                        # 100 ms (typical vapour cell)
    t2=0.01,                        # 10 ms
    m0=0.0                          # no pumping yet
)

print(f"Rb-87 Larmor frequency at 50 μT: "
      f"{RB87_PARAMS.gamma * 50e-6 / (2*np.pi):.0f} Hz")
#+end_src

#+RESULTS:
: Rb-87 Larmor frequency at 50 μT: 175000 Hz

